{
  "basics": {
    "name": "Priyam Sahoo",
    "label": "CS graduate student",
    "image": "",
    "email": "priyams3@illinois.edu",
    "url": "https://priyamsahoo.github.io/",
    "summary": "Graduate Research Student at UIUC, working on specification synthesis, code reasoning, and math/logic-guided LLMs. Past experience in building domain-specific code generation and language tooling for large-scale developer systems. Motivated to solve problems at the intersection of programming languages, AI, and formal verification.",
    "location": {
      "city": "Urbana",
      "countryCode": "US",
      "region": "Illinois"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "priyamsahoo",
        "url": "https://www.linkedin.com/in/priyamsahoo/"
      }
    ]
  },
  "work": [
    {
      "name": "PL/FM/SE Group, University of Illinois Urbana Champaign",
      "position": "Research Assistant",
      "startDate": "2024-08-20",
      "endDate": "Present",
      "summary": "Developing neural techniques to generate formal specifications from informal natural language descriptions by capturing user intent to specify the functional correctness of programs."
    },
    {
      "name": "Team wisdom, Red Hat Inc.",
      "position": "Software Engineer (research)",
      "startDate": "2023-07-01",
      "endDate": "2024-07-31",
      "summary": "Worked on developing Ansible Lightspeed Service with IBM WatsonX Code Assistance, a highly domain-specific LLM-based solution for natural language to ansible-YAML code generation."
    },
    {
      "name": "Ansible Engineering Team, Red Hat Inc.",
      "position": "Software Engineer (development)",
      "startDate": "2021-07-01",
      "endDate": "2024-06-30",
      "summary": "Developed Ansible Language Server and its VSCode extension that offers decentralized language support for Ansible language with features such as syntax highlighting, diagnostics, auto-completion and hovering, functionalities in code editors."
    },
    {
      "name": "Artificial Intelligence and Robotics (AIR) Lab, VIT and NVIDIA",
      "position": "Undergraduate Researcher",
      "startDate": "2020-08-01",
      "endDate": "2020-12-31",
      "summary": "Developed an Arduino-driven prosthetic arm with 2 degrees-of-freedom wrist and independent finger movements, equipped with a palm-mounted camera for detecting objects and executing autonomous gripping maneuvers."
    },
    {
      "name": "Reconfigurable Intelligent Systems Engineering (RISE) Lab, IIT Madras",
      "position": "Research Intern",
      "startDate": "2019-05-01",
      "endDate": "2019-07-01",
      "summary": "Contributed to Open Malware Research by developing a real-world dataset for malware behavioral analysis considering network, OS, and hardware trails for detecting malware."
    }    
  ],
  "education": [
    {
      "institution": "University of Illinois at Urbana-Champaign",
      "location": "Urbana, Illinois, USA",
      "url": "https://illinois.edu/",
      "area": "Computer Science",
      "studyType": "MSCS (Research track)",
      "startDate": "2024-08-15",
      "endDate": "Present",
      "score": "4.00 / 4.00",
      "courses": ["Courseworks: Applied Machine Learning, ML for Software Engineering, Formal Methods, Advanced Information Retrieval"]
    },
    {
      "institution": "Vellore Institure of Technology",
      "location": "Andhra Pradesh, India",
      "url": "https://vitap.ac.in/",
      "area": "Computer Science and Engineering",
      "studyType": "B.Tech",
      "startDate": "2017-07-15",
      "endDate": "2021-05-15",
      "score": "9.37 / 10.00",
      "courses": ["Courseworks: Data Structures, Design and Analysis of Algorithms, Numerical Methods, Linear Algebra, Game Theory, Operating Systems, Computer Networks, Databases, Object Oriented Programming"]
    }
  ],
  "awards": [
    {
      "title": "IBM Tech, 2024",
      "date": "2024-04-11",
      "awarder": "IBM and Red Hat Inc.",
      "summary": "Recipient of IBM Tech 2024 for being among the top 200 0.02% Red Hat individuals in terms of research innovation and impact."
    },
    {
      "title": "Chancellor’s Gold Medal, B.Tech CSE, 2021",
      "date": "2021-09-21",
      "awarder": "Vellore Institute of Technology, Andhra Pradesh",
      "summary": "Achieved 1st rank (out of 238 students) in academics in the 2021 batch of B.Tech in Computer Science and Engineering."
    },
    {
      "title": "Grant from Government of India, Department of Science & Technology (DST), under Cognitive Science Research Initiative (CSRI) scheme, 2023",
      "date": "2023-09-20",
      "awarder": "Government of India",
      "summary": "Among only 200 projects nationwide to receive the CSRI grant for a project for its significant societal importance on mental health."
    }
  ],
  "publications": [
    {
      "name": "Ansible Lightspeed: A Code Generation Service for IT Automation",
      "publisher": "39th IEEE/ACM ASE 2024",
      "releaseDate": "2024-10-27",
      "url": "https://dl.acm.org/doi/abs/10.1145/3691620.3695277",
      "summary": "Designed Ansible Lightspeed, an LLM assistant for the Ansible DSL, and conducted the first large-scale DSL code-completion study with 10,696 users, analyzing edit behavior, usage, and sentiment. Introduced the Strong Acceptance metric (49.08% on multi-line tasks) and reported 13.66% day-30 retention, showing the value of domain-tuned models; released the service and evaluation framework."
    },
    {
      "name": "Vision enabled Smart Prosthetic Arm for Amputees",
      "publisher": "2021 IEEE iSES",
      "releaseDate": "1905-03-18",
      "url": "https://ieeexplore.ieee.org/document/9701082",
      "summary": "Built an Arduino prosthetic arm with a palm camera and a two-degree-of-freedom wrist that detects objects and auto-selects grips using YOLOv3/GR-ConvNet; recorded grip demos with Leap Motion and IR sensors via Johnny-Five. Reached 94.6% grasp success across five strategies with independent finger, force, and position control."
    },
    {
      "name": "Comparative Empirical Analysis of Some Computational Algorithms using Different Programming Languages",
      "publisher": "2020 IEEE AISP",
      "releaseDate": "1916-03-20",
      "url": "https://ieeexplore.ieee.org/xpl/conhome/9057353/proceeding",
      "summary": "Poster presentation on Empirical Analysis of Algorithms by benchmarking 11 classic algorithms in C++, Java, and Python (1,000-run averages; Valgrind Massif) to compare runtime and memory; C++ led both, and Python generally beat Java except on OBST."
    }
  ],
  "skills": [
    {
      "name": "Langauges",
      "icon": "fa-solid fa-code",
      "keywords": [
        "Python",
        "C++",
        "TypeScript",
        "Java",
        "Kotlin",
        "Lean"
      ]
    },
    {
      "name": "Cloud and Infra",
      "icon": "fa-solid fa-cubes",
      "keywords": [
        "AWS (EC2, S3, Lambda, RDS)",
        "Docker",
        "Kubernetes",
        "Terraform",
        "CI/CD (GitHub Actions, Jenkins)"
      ]
    },
    {
      "name": "Frameworks",
      "icon": "fa-solid  fa-desktop",
      "keywords": [
        "PyTorch",
        "TensorFlow",
        "Transformers (HuggingFace)",
        "React.js",
        "Node.js",
        "Django",
        "Flask",
        "Android SDK"
      ]
    },
    {
      "name": "AI and MLOps",
      "icon": "fa-solid fa-cogs",
      "keywords": [
        "Fine-Tuning",
        "Retrieval-Augmented Generation (RAG)",
        "LoRA",
        "PEFT",
        "Quantization",
        "Reinforcement Learning",
        "Neuromorphic AI",
        "Agentic AI"
      ]
    }
  ],
  "projects": [
    {
      "name": "Quantum Computing",
      "summary": "Quantum computing is the use of quantum-mechanical phenomena such as superposition and entanglement to perform computation. Computers that perform quantum computations are known as quantum computers.",
      "highlights": ["Quantum Teleportation", "Quantum Cryptography"],
      "startDate": "2018-01-01",
      "endDate": "2018-01-01",
      "url": "https://example.com"
    }
  ]
}
